Revit 2027 API
Transform Constructor
The copy constructor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform(
	Transform source
)
Public Sub New (
	source As Transform
)
public:
Transform(
	Transform^ source
)
new :
        source : Transform -> Transform
Parameters
source Transform
See Also
Reference
Transform Class
Autodesk.Revit.DB Namespace